# MaxWidthAndHeightReached Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GenericMEPFailures..::..MaxWidthAndHeightReached Property
BuiltInFailures..::..GenericMEPFailures Class See Also
---
Maximum width and height reached during sizing
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MaxWidthAndHeightReached { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MaxWidthAndHeightReached As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MaxWidthAndHeightReached {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GenericMEPFailures Class
Autodesk.Revit.DB Namespace